In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
import pandas as pd

In [54]:
df = pd.read_csv('data/stackoverflow/survey_results_public.csv')  #doublequote,delimiter ,lineterminator ,header,skip_rows ,skip_footer,escapechar

In [174]:
df #by default shows 20 columns , set_options - pd.set_option('display.max_columns', 79)
pd.set_option('display.max_rows', None) #show all
pd.set_option('display.max_columns', None) #show all

In [ ]:
df.shape #(73268	79)
df.info()

In [9]:
pd.set_option('display.max_columns', 79)

In [ ]:
schema_df = pd.read_csv('data/stackoverflow/survey_results_schema.csv'
                        ,index_col = ["qname"] #add index to search data 
                        ,header = 0
                        ) 
schema_df.shape
#schema_df.info
pd.set_option('display.max_rows', None) #show all
pd.set_option('display.max_columns', None) #show all
schema_df

In [ ]:
df.head(10)
#df.tail

***Pandas loc - index based and iloc - label based***

In [55]:
person = {"firstname" : ["Sabyasachi","Simon"] ,"lastname" : ["Nayak","Cowell"] , "email" :["snayak@company.com" ,"simonc@company.com" ]  }
type(person)

dict

In [40]:
#can take a dict ,list
#pd.DataFrame(index , data , columns)
persondf = pd.DataFrame(person)
persondf[["firstname",'email']]

numberdf = pd.DataFrame(data = [[1,2],[2,4] ,[3,6]]  ,index = [0,1,2] , columns=['number','multiplier'])
numberdf

data = {"FirstName": ["Ruchi","Rose","Vin"] , "LastName" : ["Sharma","White","Diesel"] , "RID" :[1,2,3], "Score" : pd.Series([10.0,9.0] , index = [1,2]) }
peopledf = pd.DataFrame( data , index=[0,1,2])
peopledf 

cardata = [ ["40 kmph" , 1988 , 34000.00] , ["60 kmph",1994 , 38000.00]  ]
cardf = pd.DataFrame( cardata , index = ["Toyata" ,"Ford"] ,columns = ["Speed" , "model" , "price"] )

dict(cardf.loc["Ford",["model","Speed","price"]]) #index , field

    firstname               email
0  Sabyasachi  snayak@company.com
1       Simon  simonc@company.com

   number  multiplier
0       1           2
1       2           4
2       3           6

  FirstName LastName  RID  Score
0     Ruchi   Sharma    1    NaN
1      Rose    White    2   10.0
2       Vin   Diesel    3    9.0

{'model': 1994, 'Speed': '60 kmph', 'price': 38000.0}

In [36]:
persondf.shape #(2, 3)
persondf.info()
persondf.columns #list of columns

#.loc[row_indexer,col_indexer] 
persondf.iloc[ [0 , 1] , [2, 1] ] #grab first 2 rows for email and lastname (index-based)
persondf.loc[ [0 , 1] , ["email", "lastname"] ] #grab first 2 rows for email and lastname (by name)

(2, 3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   firstname  2 non-null      object
 1   lastname   2 non-null      object
 2   email      2 non-null      object
dtypes: object(3)
memory usage: 176.0+ bytes

Index(['firstname', 'lastname', 'email'], dtype='object')

                email lastname
0  snayak@company.com    Nayak
1  simonc@company.com   Cowell

                email lastname
0  snayak@company.com    Nayak
1  simonc@company.com   Cowell

In [43]:
#grab first 10 rows and display first 3 columns
df.loc[0:10 , "ResponseId":"Employment"] #inclusive of the stop

,ResponseId,MainBranch,Employment
0,1,None of these,NaN
1,2,I am a developer by profession,"Employed, full-time"
2,3,"I am not primarily a developer, but I write co...","Employed, full-time"
3,4,I am a developer by profession,"Employed, full-time"
4,5,I am a developer by profession,"Employed, full-time"
5,6,"I am not primarily a developer, but I write co...","Student, full-time"
6,7,I code primarily as a hobby,"Student, part-time"
7,8,I am a developer by profession,"Not employed, but looking for work"
8,9,I am a developer by profession,"Employed, full-time"
9,10,I am a developer by profession,"Independent contractor, freelancer, or self-em..."
10,11,I am a developer by profession,"Employed, full-time"

***Pandas index set and reset***

In [51]:
#setting custom index
persondf.set_index('email', inplace=True)
persondf #here email unique values are acting as an index instead of default 0 ,1 ....n index rows

#peopledf.set_index('RID' )
peopledf #still shows old index
peopledf.set_index('RID' , inplace = True )
peopledf #reflects new index

    FirstName LastName  Score
RID
1       Ruchi   Sharma    NaN
2        Rose    White   10.0
3         Vin   Diesel    9.0

KeyError: "None of ['RID'] are in the columns"

In [52]:
#get the last name for the index simonc@company.com
persondf.loc["simonc@company.com" , "lastname"]

'Cowell'

In [18]:
#reset it back to use integers indexes
persondf.reset_index(inplace=True)
persondf #now index is 0 based

   level_0  index               email   firstname lastname
0        0      0  snayak@company.com  Sabyasachi    Nayak
1        1      1  simonc@company.com       Simon   Cowell

In [ ]:
schema_df.loc["YearsCodePro"] #all field values corresponding to index value - YearsCodePro

schema_df.loc["YearsCodePro" , "question"] #display only the question field value

In [ ]:
schema_df.sort_index(ascending=False) #sort index in descending order

***Filters***

In [43]:
 #A filtr is a view on the actual df , filter is a conditional expression that creates a series / dataframe rows
filtr = ((persondf['lastname'] == 'Nayak') | (persondf['firstname']=='Simon'))
filtr2 = ((persondf['lastname'] == 'Cowell') & (persondf['firstname']=='Simon'))
persondf.loc[filtr , 'email']
persondf.loc[filtr2 , 'email']

1    simonc@company.com
Name: email, dtype: object

In [49]:
df.columns

Index(['ResponseId', 'MainBranch', 'Employment', 'RemoteWork',
       'CodingActivities', 'EdLevel', 'LearnCode', 'LearnCodeOnline',
       'LearnCodeCoursesCert', 'YearsCode', 'YearsCodePro', 'DevType',
       'OrgSize', 'PurchaseInfluence', 'BuyNewTool', 'Country', 'Currency',
       'CompTotal', 'CompFreq', 'LanguageHaveWorkedWith',
       'LanguageWantToWorkWith', 'DatabaseHaveWorkedWith',
       'DatabaseWantToWorkWith', 'PlatformHaveWorkedWith',
       'PlatformWantToWorkWith', 'WebframeHaveWorkedWith',
       'WebframeWantToWorkWith', 'MiscTechHaveWorkedWith',
       'MiscTechWantToWorkWith', 'ToolsTechHaveWorkedWith',
       'ToolsTechWantToWorkWith', 'NEWCollabToolsHaveWorkedWith',
       'NEWCollabToolsWantToWorkWith', 'OpSysProfessional use',
       'OpSysPersonal use', 'VersionControlSystem', 'VCInteraction',
       'VCHostingPersonal use', 'VCHostingProfessional use',
       'OfficeStackAsyncHaveWorkedWith', 'OfficeStackAsyncWantToWorkWith',
       'OfficeStackSyncHaveWorkedWith', 'OfficeStackSyncWantToWorkWith',
       'Blockchain', 'NEWSOSites', 'SOVisitFreq', 'SOAccount', 'SOPartFreq',
       'SOComm', 'Age', 'Gender', 'Trans', 'Sexuality', 'Ethnicity',
       'Accessibility', 'MentalHealth', 'TBranch', 'ICorPM', 'WorkExp',
       'Knowledge_1', 'Knowledge_2', 'Knowledge_3', 'Knowledge_4',
       'Knowledge_5', 'Knowledge_6', 'Knowledge_7', 'Frequency_1',
       'Frequency_2', 'Frequency_3', 'TimeSearching', 'TimeAnswering',
       'Onboarding', 'ProfessionalTech', 'TrueFalse_1', 'TrueFalse_2',
       'TrueFalse_3', 'SurveyLength', 'SurveyEase', 'ConvertedCompYearly'],
      dtype='object')

In [59]:
countries = ['Germany','India']
high_salary = ((df['CompTotal'] > 70000) & (df['Country'].isin(countries)) )
Pythonista = df['LanguageHaveWorkedWith'].str.contains('Python',na=False)
df.loc[(high_salary)&(Pythonista),['Country','LanguageHaveWorkedWith','CompTotal']]

       Country                             LanguageHaveWorkedWith  CompTotal
151      India     Bash/Shell;HTML/CSS;Java;JavaScript;Python;SQL   100000.0
161    Germany                                             Python   155000.0
196      India                             Python;Rust;TypeScript  4500000.0
449    Germany                        Assembly;C;PHP;Python;R;SQL   120000.0
525      India                                          Go;Python   200000.0
...        ...                                                ...        ...
72770    India  Assembly;Bash/Shell;C;C#;C++;Delphi;HTML/CSS;J...  1200000.0
72886  Germany   Bash/Shell;HTML/CSS;JavaScript;Python;TypeScript    90000.0
73124    India                     HTML/CSS;JavaScript;Python;SQL   500000.0
73136    India                        C++;JavaScript;Python;R;SQL  1600000.0
73184    India                                        Java;Python  2000000.0

[1155 rows x 3 columns]

In [112]:
#update column names
persondf.columns =[x.upper() for x in persondf.columns]
#persondf.columns = persondf.columns.str.replace(" ","")
persondf

    FIRSTNAME LASTNAME               EMAIL
0  Sabyasachi    Nayak  snayak@company.com
1       Simon   Cowell  simonc@company.com

In [113]:
#rename fields and show the output without changes in place
persondf.rename(columns={'FIRSTNAME' : 'first','LASTNAME' : 'last','EMAIL':'emailaddress'} )
#rename fields and show the output with changes in place
persondf.rename(columns={'FIRSTNAME' : 'first','LASTNAME' : 'last','EMAIL':'emailaddress'} ,inplace=True   )

In [147]:
display(persondf)

    firstname lastname               email
0  Sabyasachi    Nayak  snayak@company.com
1       Simon   Cowell  simonc@company.com

In [148]:
#update single row targeting multiple fields using loc
persondf.loc[0 ,['first','emailaddress']] = ['Sachi' , 'snayak@xyz.com']
#persondf = persondf.loc[0: , ['first','last','emailaddress']]
persondf

    firstname lastname               email  first    emailaddress
0  Sabyasachi    Nayak  snayak@company.com  Sachi  snayak@xyz.com
1       Simon   Cowell  simonc@company.com    NaN             NaN

In [115]:
#update single row using loc by first filtering a particular record

filtr = (persondf['first'] == 'Sachi') #A filtr is a view on the actual df
persondf[filtr]['first'] = 'Sabya' #Doesn't work ,A value is trying to be set on a copy of a slice from a DataFrame.

#Try using .loc[row_indexer,col_indexer] = value instead
persondf.loc[filtr , 'first'] = 'Sabya' #Works with loc
persondf

        first    last        emailaddress
0  Sabyasachi   Nayak  snayak@company.com
1       Simon  Cowell  simonc@company.com

In [116]:
#change multiple rows at once ,the simple way
persondf['emailaddress'] = persondf['emailaddress'].str.upper()

In [120]:
#using apply on series data

#using lambda
persondf['emailaddress'] =persondf['emailaddress'].apply(lambda x : x.lower()) 
persondf

 #passing udf
def update_email_casing(email):
    return email.upper()

persondf['emailaddress'] =persondf['emailaddress'].apply(update_email_casing) 
persondf

persondf.apply(pd.Series.min)

first                   Sabyasachi
last                        Cowell
emailaddress    SIMONC@COMPANY.COM
dtype: object

In [119]:
#using apply on dataframe
persondf.apply(lambda x:x.min())

first                   Sabyasachi
last                        Cowell
emailaddress    SIMONC@COMPANY.COM
dtype: object

In [130]:
#difference between apply on dataframe vs series
persondf.apply(len) #get the number of values in each field in case of apply on dataframe
persondf["last"].apply(len) #get actual length of values in case of apply on series

first           2
last            2
emailaddress    2
dtype: int64

0    5
1    6
Name: last, dtype: int64

In [137]:
#applymap only works on dataframe where it applies the function on each element in a df
persondf.applymap(len)
#persondf.applymap(str.replace(" ","")) #not working?

   first  last  emailaddress
0     10     5            18
1      5     6            18

TypeError: replace expected at least 2 arguments, got 1

In [138]:
persondf['first'].replace({'Sabyasachi':'Sabya'})

0    Sabya
1    Simon
Name: first, dtype: object

In [ ]:
#map - caveat - rest of the values will be NaN
#df["Sexuality"].map({"Straight / Heterosexual": "S/HS" , "Bisexual": "Bi", "Gay or Lesbian": "G/L"}) 

# use replace instead
df["Sexuality"].replace({"Straight / Heterosexual": "S/HS" , "Bisexual": "Bi", "Gay or Lesbian": "G/L"})

***Add/remove rows/columns***

In [56]:
persondf['fullname'] = persondf['firstname'] + persondf['lastname']

In [70]:
persondf.reset_index(inplace=True)
#persondf.drop(columns=['firstname','lastname'] ,inplace = True)
#persondf.drop(['fullname'] , axis = 1) #using axis = 1 refers to columns 

#persondf.drop([1] , inplace=True) #drop by row indexer index value

persondf.set_index(['email'] , inplace=True)
persondf.drop(['snayak@company.com']) #drop by row indexer email label

                    index     fullname
email
simonc@company.com      1  SimonCowell

In [164]:
#
persondf['fullname'] = persondf['firstname'] + ' ' + persondf['lastname']

In [53]:
#split a string and assign to 2 variables at a time
persondf[['first','last']] = persondf['fullname'].str.split(' ', expand = True)
persondf

KeyError: 'fullname'

In [67]:
path = 'C:\\Users\\conne\\snowflake\\files\\load\correct_data.csv'

#usecols = ['Address', 'Supplier', 'SupplierCode']
#nrows = 3
#skipfooter = 1
#skip_blank_lines
#chunksize = 40000
#parallel = 2
#dateformat = 'MM-dd-YYYY'
datadf = pd.read_csv(path, delimiter="," , header = 0  ,index_col = ['Supplier','SupplierCode'],skiprows = [3,5])

In [68]:
datadf

                                                   Address  Unnamed: 3  Rating
Supplier         SupplierCode
AQUA PRIVATE LTD X-1121        685,SaheedNagar,BBSR,Odisha         NaN     5.0
ABC PRIVATE LTD  X-1001               605,SaheedNagar,BBSR         NaN     NaN
Maa Diagnostic   X-234                670,SaheedNagar,BBSR         NaN     NaN

In [61]:

datadf.loc["AQUA PRIVATE LTD",'X-1121'] #search by index

Address       685,SaheedNagar,BBSR,Odisha
Unnamed: 3                            NaN
Rating                                  5
Name: (AQUA PRIVATE LTD, X-1121), dtype: object

In [65]:
datadf.loc["AQUA PRIVATE LTD",'Address':'Rating']

                                  Address  Unnamed: 3  Rating
SupplierCode
X-1121        685,SaheedNagar,BBSR,Odisha         NaN       5

In [77]:
#np.nan ,pd.NaT ,pd.Timestamp("1940-04-25")

datadf.dropna(axis='index' , thresh = 1 , subset = 'Rating') #remove more than one NaN row wise
datadf.dropna(axis='columns') #remove unnamed columns
datadf.dropna(axis='columns' , how = 'any') #remove unnamed columns
datadf.dropna(axis='columns' , how = 'any')

                                                   Address  Unnamed: 3  Rating
Supplier         SupplierCode
AQUA PRIVATE LTD X-1121        685,SaheedNagar,BBSR,Odisha         NaN     5.0

                                                   Address
Supplier         SupplierCode
AQUA PRIVATE LTD X-1121        685,SaheedNagar,BBSR,Odisha
ABC PRIVATE LTD  X-1001               605,SaheedNagar,BBSR
Maa Diagnostic   X-234                670,SaheedNagar,BBSR

                                                   Address
Supplier         SupplierCode
AQUA PRIVATE LTD X-1121        685,SaheedNagar,BBSR,Odisha
ABC PRIVATE LTD  X-1001               605,SaheedNagar,BBSR
Maa Diagnostic   X-234                670,SaheedNagar,BBSR

In [296]:
dir = 'C:\\Users\\conne\\snowflake\\files\\load\\'

path = dir + 'bad_data.csv'

baddf = pd.read_csv(path , delimiter = '\r\n' ,header= None , index_col = None , engine = 'python') 


baddf[['Supplier', 'SupplierCode','Address']] = baddf[0].str.split(',', n=2,expand=True) # n - 0,1,2
baddf['Address'] = '"' + baddf['Address'] + '"'

# baddf.columns[0]
# baddf.drop(columns = [0])
baddf = baddf.iloc[:, 1:]

baddf

baddf.to_csv(dir+'corrected_data.csv' , index = False  , mode='w' ,header = None)



    # quoting: CSVQuoting = ...,
    # quotechar: _str = ...,
    # lineterminator: _str | None = ...,
    # chunksize: int | None = ...,
    # date_format: _str | None = ...,
    # doublequote: _bool = ...,
    # escapechar: _str | None = ...,

           Supplier  SupplierCode                        Address
0          Supplier  SupplierCode                      "Address"
1  AQUA PRIVATE LTD        X-1121  "685,SaheedNagar,BBSR,Odisha"
2   ABC PRIVATE LTD        X-1001         "605,SaheedNagar,BBSR"
3     OM Diagnostic         X-234         "676,SaheedNagar,BBSR"

In [152]:
dir = 'C:\\Users\\conne\\snowflake\\files\\load\\'

path = dir + 'corrected_data.csv'

correcteddf = pd.read_csv(path , sep= ',',header= 0 , index_col = None) 

correcteddf

                     Supplier,SupplierCode,"Address"
0  AQUA PRIVATE LTD,X-1121,"685,SaheedNagar,BBSR,...
1      ABC PRIVATE LTD,X-1001,"605,SaheedNagar,BBSR"
2         OM Diagnostic,X-234,"676,SaheedNagar,BBSR"


import sqlalchemy
import pandas
engine = sqlalchemy.create_engine(
    sqlalchemy.engine.url.URL(
        drivername="postgresql",
        username="username",
        password="password",
        host="host",
        port="port",
        database="database",
    ),
    echo_pool=True,
)
print("connecting with engine " + str(engine))
connection = engine.connect()
query = "select * from table"
df = pd.read_sql_query(query, connection)

!pip install ipython-sql
%load_ext sql
print("connecting with engine " + str(engine))

%%sql
CREATE TABLE sales
(
    key       varchar(6),
    ts        timestamp,
    product   integer,
    completed boolean,
    price     float
);
INSERT INTO sales
VALUES ('sale_1', '2019-11-08 00:00', 0, TRUE, 1.1),
       ('sale_2', '2019-11-08 01:00', 0, FALSE, 1.2),
       ('sale_3', '2019-11-08 01:00', 0, TRUE, 1.3),
       ('sale_4', '2019-11-08 01:00', 1, FALSE, 1.4),
       ('sale_5', '2019-11-08 02:00', 1, TRUE, 1.5),
       ('sale_6', '2019-11-08 02:00', 1, TRUE, 1.5);

%%sql
select * from sales;